In [2]:
#data acess and familiarization
import pandas as pd
import numpy as np
df=pd.read_csv("Bank_customer_churn_dataset.csv")
df.head()

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [3]:
df.shape

(10000, 12)

In [4]:
df.columns

Index(['customer_id', 'credit_score', 'country', 'gender', 'age', 'tenure',
       'balance', 'products_number', 'credit_card', 'active_member',
       'estimated_salary', 'churn'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       10000 non-null  int64
 1   credit_score      10000 non-null  int64
 2   country           10000 non-null  object
 3   gender            10000 non-null  object
 4   age               10000 non-null  int64
 5   tenure            10000 non-null  int64
 6   balance           10000 non-null  float64
 7   products_number   10000 non-null  int64
 8   credit_card       10000 non-null  int64
 9   active_member     10000 non-null  int64
 10  estimated_salary  10000 non-null  float64
 11  churn             10000 non-null  int64
dtypes: float64(2), int64(8), object(2)
memory usage: 937.6+ KB

In [6]:
df.describe()

,customer_id,credit_score,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
count,1.000000e+04,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000
mean,1.569094e+07,650.528800,38.921800,5.012800,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700
std,7.193619e+04,96.653299,10.487806,2.892174,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769
min,1.556570e+07,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000
25%,1.562853e+07,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000
50%,1.569074e+07,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000
75%,1.575323e+07,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000
max,1.581569e+07,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000

In [7]:
#Data Quanlity Assessment
df.duplicated().sum()

np.int64(0)

In [8]:
df.isnull().sum()

customer_id         0
credit_score        0
country             0
gender              0
age                 0
tenure              0
balance             0
products_number     0
credit_card         0
active_member       0
estimated_salary    0
churn               0
dtype: int64

In [9]:
df.dtypes

customer_id           int64
credit_score          int64
country              object
gender               object
age                   int64
tenure                int64
balance             float64
products_number       int64
credit_card           int64
active_member         int64
estimated_salary    float64
churn                 int64
dtype: object

In [11]:
df['age'].value_counts().head()

age
37    478
38    477
35    474
36    456
34    447
Name: count, dtype: int64

In [12]:
Q1 = df[['credit_score','age','balance','estimated_salary']].quantile(0.25)
Q3 = df[['credit_score','age','balance','estimated_salary']].quantile(0.75)
IQR = Q3 - Q1

outliers = ((df[['credit_score','age','balance','estimated_salary']] < (Q1 - 1.5 * IQR)) |
            (df[['credit_score','age','balance','estimated_salary']] > (Q3 + 1.5 * IQR))).sum()

outliers

credit_score         15
age                 359
balance               0
estimated_salary      0
dtype: int64

In [13]:
df[df['age'] < 18].shape[0]

0

In [14]:
df[df['credit_score'] < 300].shape[0]

0

In [15]:
df['churn'].value_counts(normalize=True) * 100

churn
0    79.63
1    20.37
Name: proportion, dtype: float64

In [16]:
#Data Cleaning and Transformation
df_clean=df.copy()

In [17]:
df_clean=df_clean.drop_duplicates()

In [18]:
df_clean.isnull().sum()

customer_id         0
credit_score        0
country             0
gender              0
age                 0
tenure              0
balance             0
products_number     0
credit_card         0
active_member       0
estimated_salary    0
churn               0
dtype: int64

In [19]:
df_clean['Age_Group'] = pd.cut(
    df_clean['age'],
    bins=[0, 30, 45, 60, 100],
    labels=['Young', 'Middle-Aged', 'Senior', 'Elder']
)

In [20]:
df_clean['Tenure_Group'] = pd.cut(
    df_clean['tenure'],
    bins=[-1, 2, 5, 10],
    labels=['New', 'Mid-Term', 'Long-Term']
)

In [21]:
df_clean['Balance_Salary_Ratio'] = df_clean['balance'] / (df_clean['estimated_salary'] + 1)

In [22]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   customer_id           10000 non-null  int64
 1   credit_score          10000 non-null  int64
 2   country               10000 non-null  object
 3   gender                10000 non-null  object
 4   age                   10000 non-null  int64
 5   tenure                10000 non-null  int64
 6   balance               10000 non-null  float64
 7   products_number       10000 non-null  int64
 8   credit_card           10000 non-null  int64
 9   active_member         10000 non-null  int64
 10  estimated_salary      10000 non-null  float64
 11  churn                 10000 non-null  int64
 12  Age_Group             10000 non-null  category
 13  Tenure_Group          10000 non-null  category
 14  Balance_Salary_Ratio  10000 non-null  float64
dtypes: category(2), float64(3), int64(8), object(2)
memory usage: 1.0+ MB

In [23]:
df_clean.describe()

,customer_id,credit_score,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn,Balance_Salary_Ratio
count,1.000000e+04,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000,10000.000000,10000.000000
mean,1.569094e+07,650.528800,38.921800,5.012800,76485.889288,1.530200,0.70550,0.515100,100090.239881,0.203700,3.790150
std,7.193619e+04,96.653299,10.487806,2.892174,62397.405202,0.581654,0.45584,0.499797,57510.492818,0.402769,100.055758
min,1.556570e+07,350.000000,18.000000,0.000000,0.000000,1.000000,0.00000,0.000000,11.580000,0.000000,0.000000
25%,1.562853e+07,584.000000,32.000000,3.000000,0.000000,1.000000,0.00000,0.000000,51002.110000,0.000000,0.000000
50%,1.569074e+07,652.000000,37.000000,5.000000,97198.540000,1.000000,1.00000,1.000000,100193.915000,0.000000,0.746998
75%,1.575323e+07,718.000000,44.000000,7.000000,127644.240000,2.000000,1.00000,1.000000,149388.247500,0.000000,1.514002
max,1.581569e+07,850.000000,92.000000,10.000000,250898.090000,4.000000,1.00000,1.000000,199992.480000,1.000000,9770.883148

In [25]:
df_clean.to_csv("cleaned_bank_churn.csv",index=False)

In [26]:

df=pd.read_csv("cleaned_bank_churn.csv")

In [28]:
df_clean[['age', 'Age_Group', 'tenure', 'Tenure_Group']].head()
# Newly engineered features may not appear in previously executed display outputs and require re-running the display cells.

   age    Age_Group  tenure Tenure_Group
0   42  Middle-Aged       2          New
1   41  Middle-Aged       1          New
2   42  Middle-Aged       8    Long-Term
3   39  Middle-Aged       1          New
4   43  Middle-Aged       2          New